var groups = [
    {
        name: "Музеи",
        style: "islands#redIcon",
        items: [
            {
            center: [55.836729, 37.628041],
            name: "Арт-лофт Чудеса"
            },
            {
            center: [55.836250, 37.627064],
            name: "Арт-резиденция и мастерские музея Гараж"
            },
            {
            center: [55.839471, 37.620766],
            name: "Броненосец"
            },
            {
            center: [55.836379, 37.636386],
            name: "Бюст Г.К. Жукова"
            },
            {
            center: [55.828042, 37.634724],
            name: "В.И. Ленин"
            },
            {
            center: [55.826249, 37.637578],
            name: "ВДНХ"
            },
            {
            center: [55.834053, 37.622287],
            name: "Вертолёт Ми-8"
            },
            {
            center: [55.829880, 37.635126],
            name: "Выставка актуального народного искусства"
            },
            {
            center: [55.829970, 37.633791],
            name: "Дворец госуслуг МФЦ, павильон № 71"
            },
            {
            center: [55.832679, 37.619946],
            name: "Дельфины"
            },
            {
            center: [55.832096, 37.617334],
            name: "Детское посольство"
            },
            {
            center: [55.833743, 37.631765],
            name: "Детское посольство"
            },
            {
            center: [55.833371, 37.634525],
            name: "Дом культуры ВДНХ"
            },
            {
            center: [55.831551, 37.617536],
            name: "Зеленый театр ВДНХ"
            },
            {
            center: [55.834460, 37.616695],
            name: "И.В. Мичурин"
            },
            {
            center: [55.833840, 37.626198],
            name: "Исторический парк Россия – моя история"
            },
            {
            center: [55.832016, 37.623054],
            name: "Макет космического корабля Буран"
            },
            {
            center: [55.834308, 37.623085],
            name: "Макет ракеты-носителя Восток"
            },
            {
            center: [55.823307, 37.631855],
            name: "Мемориальный дом-музей академика С.П. Королёва"
            },
            {
            center: [55.826591, 37.638033],
            name: "Музей ВДНХ"
            },
            {
            center: [55.837183, 37.621347],
            name: "Музей Гаража особого назначения ФСО России"
            },
            {
            center: [55.832879, 37.631125],
            name: "Музей Магии и Фокусов"
            },
            {
            center: [55.823294, 37.639853],
            name: "Музей космонавтики"
            },
            {
            center: [55.824657, 37.614676],
            name: "Музей-усадьба Останкино"
            },
            {
            center: [55.831419, 37.623967],
            name: "Мультимедиа галерея Лес"
            },
            {
            center: [55.835889, 37.636454],
            name: "Оружие победы Т-80уд"
            },
            {
            center: [55.838737, 37.625993],
            name: "Охотник"
            },
            {
            center: [55.834418, 37.630189],
            name: "Павильон Макет Москвы"
            },
            {
            center: [55.828071, 37.647093],
            name: "Павильон Рабочий и колхозница"
            },
            {
            center: [55.833999, 37.630874],
            name: "Павильон Умный город"
            },
            {
            center: [55.828598, 37.633872],
            name: "Павильон № 1 Центральный"
            },
            {
            center: [55.829620, 37.629884],
            name: "Павильон № 10 Молдова"
            },
            {
            center: [55.830239, 37.629268],
            name: "Павильон № 11 Казахстан"
            },
            {
            center: [55.830596, 37.628529],
            name: "Павильон № 12 Выставочный центр профсоюзов"
            },
            {
            center: [55.830965, 37.628065],
            name: "Павильон № 13 Музей Востока"
            },
            {
            center: [55.831259, 37.627590],
            name: "Павильон № 14 Азербайджан"
            },
            {
            center: [55.831620, 37.626761],
            name: "Павильон № 15 Олимпийский музей России"
            },
            {
            center: [55.830584, 37.622835],
            name: "Павильон № 16"
            },
            {
            center: [55.832086, 37.625830],
            name: "Павильон № 18 Республика Беларусь"
            },
            {
            center: [55.828660, 37.631427],
            name: "Павильон № 2 Робостанция"
            },
            {
            center: [55.832932, 37.621971],
            name: "Павильон № 20 Центральный дом автоспорта"
            },
            {
            center: [55.832293, 37.620564],
            name: "Павильон № 21"
            },
            {
            center: [55.832246, 37.616529],
            name: "Павильон № 22 Скалолазный центр BigWall"
            },
            {
            center: [55.833743, 37.619619],
            name: "Павильон № 25 Музей нефти"
            },
            {
            center: [55.834312, 37.621751],
            name: "Павильон № 26 Музей транспорта Москвы"
            },
            {
            center: [55.834544, 37.612828],
            name: "Павильон № 27 Физкультура и спорт"
            },
            {
            center: [55.836290, 37.616420],
            name: "Павильон № 28 Эколого-просветительский центр Пчеловодство"
            },
            {
            center: [55.835751, 37.618203],
            name: "Павильон № 29 Цветоводство"
            },
            {
            center: [55.834872, 37.618655],
            name: "Павильон № 30 Биотехнологии"
            },
            {
            center: [55.834919, 37.619728],
            name: "Павильон № 31 Государственный биологический музей им. К.А. Тимирязева"
            },
            {
            center: [55.838423, 37.614388],
            name: "Павильон № 35 Главтабак"
            },
            {
            center: [55.839378, 37.616988],
            name: "Павильон № 36 Музей кино"
            },
            {
            center: [55.839842, 37.619280],
            name: "Павильон № 37 Птицеводство"
            },
            {
            center: [55.839657, 37.621512],
            name: "Павильон № 38 БизнесТехноград"
            },
            {
            center: [55.828567, 37.630269],
            name: "Павильон № 4 Киргизия"
            },
            {
            center: [55.838117, 37.620536],
            name: "Павильон № 40 Школа пекарей"
            },
            {
            center: [55.838080, 37.622197],
            name: "Павильон № 41 Центр национальных конных традиций"
            },
            {
            center: [55.838056, 37.624042],
            name: "Павильон № 43 Центр национальных конных традиций"
            },
            {
            center: [55.840597, 37.625439],
            name: "Павильон № 44 Кролиководство"
            },
            {
            center: [55.838345, 37.628216],
            name: "Павильон № 46 Экономика и организация АПК"
            },
            {
            center: [55.837271, 37.624137],
            name: "Павильон № 47 Дом ремесел"
            },
            {
            center: [55.837340, 37.622524],
            name: "Павильон № 48 Главпиво"
            },
            {
            center: [55.837736, 37.620801],
            name: "Павильон № 49"
            },
            {
            center: [55.828794, 37.629733],
            name: "Павильон № 5 Музей городского хозяйства Москвы"
            },
            {
            center: [55.837745, 37.619406],
            name: "Павильон № 50 Молокотека"
            },
            {
            center: [55.837202, 37.619229],
            name: "Павильон № 51 Мясная промышленность"
            },
            {
            center: [55.836447, 37.622284],
            name: "Павильон № 54 Музей Гаража особого назначения ФСО России"
            },
            {
            center: [55.835031, 37.623354],
            name: "Павильон № 55 Музей оптических иллюзий"
            },
            {
            center: [55.832645, 37.627215],
            name: "Павильон № 58 Центр славянской письменности Слово"
            },
            {
            center: [55.833269, 37.628130],
            name: "Павильон № 59 Зерно"
            },
            {
            center: [55.833865, 37.628170],
            name: "Павильон № 60 Потребительская кооперация"
            },
            {
            center: [55.834623, 37.628492],
            name: "Павильон № 61 Центросоюз"
            },
            {
            center: [55.835137, 37.627619],
            name: "Павильон № 62 Международный центр балета"
            },
            {
            center: [55.832802, 37.629093],
            name: "Павильон № 64 Выставочный комплекс РЖД"
            },
            {
            center: [55.831620, 37.631933],
            name: "Павильон № 66 Узбекистан"
            },
            {
            center: [55.830932, 37.632602],
            name: "Павильон № 67 Карелия"
            },
            {
            center: [55.830684, 37.633393],
            name: "Павильон № 68 Армения"
            },
            {
            center: [55.828991, 37.642187],
            name: "Павильон № 70 Монреальский"
            },
            {
            center: [55.830853, 37.638237],
            name: "Павильон № 75 Экспо"
            },
            {
            center: [55.828891, 37.627317],
            name: "Павильон № 8 Музей шоколада"
            },
            {
            center: [55.829057, 37.628350],
            name: "Павильон № 9 театр сказок"
            },
            {
            center: [55.829244, 37.629485],
            name: "Павильон №6 Абхазия"
            },
            {
            center: [55.834677, 37.624594],
            name: "Памяти ополченцам-сотрудникам ВДНХ"
            },
            {
            center: [55.839444, 37.618289],
            name: "Петух"
            },
            {
            center: [55.833797, 37.623099],
            name: "Самолëт Як-42"
            },
            {
            center: [55.834795, 37.623318],
            name: "Самолёт Су-27"
            },
            {
            center: [55.831634, 37.624829],
            name: "Самосвал БелАЗ-75581"
            },
            {
            center: [55.828572, 37.628616],
            name: "Семья"
            },
            {
            center: [55.839383, 37.620423],
            name: "Скульптурная композиция Рыболовная снасть"
            },
            {
            center: [55.838709, 37.626129],
            name: "Совхозница-зверовод"
            },
            {
            center: [55.835356, 37.622432],
            name: "Сокровища гробницы Тутанхамона"
            },
            {
            center: [55.827657, 37.626905],
            name: "СоюзМультПарк"
            },
            {
            center: [55.834870, 37.622146],
            name: "Центр Космонавтика и авиация, павильон № 34 Космос"
            },
            {
            center: [55.838276, 37.623398],
            name: "Центр национальных конных традиций"
            },
        ]}
];