// Группы объектов
var groups = [
        {
            name: "Музеи",
            style: "islands#redIcon",
            items: [
                {
                    center: [55.826591, 37.638033],
                    name: "Музей ВДНХ"
                },
                {
                    center: [55.828598, 37.633872],
                    name: "Павильон № 1 Центральный"
                },
                {
                    center: [55.828660, 37.631427],
                    name: "Павильон № 2 Робостанция"
                },
                {
                    center: [55.828794, 37.629733],
                    name: "Павильон № 5 Музей городского хозяйства Москвы"
                },
                {
                    center: [55.829620, 37.629884],
                    name: "Павильон № 10 Молдова"
                },
                {
                    center: [55.830239, 37.629268],
                    name: "Павильон № 11 Казахстан"
                },
                {
                    center: [55.829970, 37.633791],
                    name: "Дворец госуслуг МФЦ, павильон № 71"
                },
                {
                    center: [55.830684, 37.633393],
                    name: "Павильон № 68 Армения"
                },
                {
                    center: [55.830932, 37.632602],
                    name: "Павильон № 67 Карелия"
                },
                {
                    center: [55.832645, 37.627215],
                    name: "Павильон № 58 Центр славянской письменности Слово"
                },
                {
                    center: [55.830853, 37.638237],
                    name: "Павильон № 75 Экспо"
                },
                {
                    center: [55.833371, 37.634525],
                    name: "Дом культуры ВДНХ"
                },
                {
                    center: [55.833840, 37.626198],
                    name: "Исторический парк Россия – моя история"
                },
                {
                    center: [55.834870, 37.622146],
                    name: "Центр Космонавтика и авиация, павильон № 34 Космос"
                },
                {
                    center: [55.834312, 37.621751],
                    name: "Павильон № 26 Музей транспорта Москвы"
                },
                {
                    center: [55.834919, 37.619728],
                    name: "Павильон № 31 Государственный биологический музей им. К.А. Тимирязева"
                },
                {
                    center: [55.834872, 37.618655],
                    name: "Павильон № 30 Биотехнологии"
                },
                {
                    center: [55.835751, 37.618203],
                    name: "Павильон № 29 Цветоводство"
                },
                {
                    center: [55.833743, 37.619619],
                    name: "Павильон № 25 Музей нефти"
                },
                {
                    center: [55.832246, 37.616529],
                    name: "Павильон № 22 Скалолазный центр BigWall"
                },
                {
                    center: [55.831419, 37.623967],
                    name: "Мультимедиа галерея Лес"
                },
                {
                    center: [55.832016, 37.623054],
                    name: "Макет космического корабля Буран"
                },
                {
                    center: [55.835031, 37.623354],
                    name: "Павильон № 55 Музей оптических иллюзий"
                },
                {
                    center: [55.834418, 37.630189],
                    name: "Павильон Макет Москвы"
                },
                {
                    center: [55.837183, 37.621347],
                    name: "Музей Гаража особого назначения ФСО России"
                },
                {
                    center: [55.837271, 37.624137],
                    name: "Павильон № 47 Дом ремесел"
                },
                {
                    center: [55.837340, 37.622524],
                    name: "Павильон № 48 Главпиво"
                },
                {
                    center: [55.838276, 37.623398],
                    name: "Центр национальных конных традиций"
                },
                {
                    center: [55.838423, 37.614388],
                    name: "Павильон № 35 Главтабак"
                },
                {
                    center: [55.839378, 37.616988],
                    name: "Павильон № 36 Музей кино"
                },
                {
                    center: [55.839842, 37.619280],
                    name: "Павильон № 37 Птицеводство"
                },
                {
                    center: [55.839657, 37.621512],
                    name: "Павильон № 38 БизнесТехноград"
                },
                {
                    center: [55.838345, 37.628216],
                    name: "Павильон № 46 Экономика и организация АПК"
                },
                {
                    center: [55.832802, 37.629093],
                    name: "Павильон № 64 Выставочный комплекс РЖД"
                },
                {
                    center: [55.835137, 37.627619],
                    name: "Павильон № 62 Международный центр балета"
                },
                {
                    center: [55.832879, 37.631125],
                    name: "Музей Магии и Фокусов"
                }
            ]},
        {
            name: "Достопримечательности",
            style: "islands#greenIcon",
            items: [
                {
                    center: [55.826249, 37.637578],
                    name: "ВДНХ"
                }
            ]},
        {
            name: "другое",
            style: "islands#blueIcon",
            items: [
                {
                    center: [55.833797, 37.623099],
                    name: "Самолëт Як-42"
                },
                {
                    center: [55.834308, 37.623085],
                    name: "Макет ракеты-носителя Восток"
                }
            ]}
    ];